# Pandas:
    (1) It is a combination of numpy and dictionary
    (2) pandas mainly consist of pandas series and pandas dataframe
    (3) syntax to import pandas: import pandas as pd

In [1]:
import pandas as pd

In [2]:
import numpy as np

# Pandas Series:
    (1) It is a one dimensional array that holds data of different type
    (2) Pandas series is like a column in a table
    (3) Index is considered as row name in pandas series
    (4) pandas series can be created by three ways:
    method(1): lists
    method(2): 1-Dimensional array
    method(3): dictionary

In [3]:
l = [10, 20, 30]
s = pd.Series(l)
print(s)

0    10
1    20
2    30
dtype: int64

In [5]:
print(type(s))
print(s.shape)

<class 'pandas.core.series.Series'>
(3,)

In [6]:
s = pd.Series(l,index=['i', 'j', 'k'])
print(s)

i    10
j    20
k    30
dtype: int64

In [12]:
# Here, We can customize the index name depends on user requirment
a = np.array([10, 20, 30])
b = pd.Series(a)
print(b)

0    10
1    20
2    30
dtype: int32

In [10]:
c = pd.Series(a,index=['a','b','c'])
print(c)

a    10
b    20
c    30
dtype: int32

In [13]:
# Here, Index argument is not needed because the key itself treated as index name
d = {'a': 10, 'b': 20, 'c': 30}
a = pd.Series(d)
print(a)

a    10
b    20
c    30
dtype: int64

# Pandas DataFrame:
    (1) Pandas DataFrame is a two dimensional data structure or 2D array or table with rows and columns
    (2) Pandas DataFrame is created in three ways:
    method(1): nested lists
    method(2): 2-Dimensional array
    method(3): dictionary

In [14]:
d = {'col1':[1,2], 'col2':[3,4]}
a = pd.Series(d)
print(a.shape)
print(a)

(2,)
col1    [1, 2]
col2    [3, 4]
dtype: object

In [15]:
d  = {'col1':[1,2], 'col2':[3,4]}
df = pd.DataFrame(d)
print(type(df))
print(df.shape)
print(df)

<class 'pandas.core.frame.DataFrame'>
(2, 2)
   col1  col2
0     1     3
1     2     4

In [16]:
l = [[1,2,3],[4,5,6]]
df = pd.DataFrame(l)
print(df.shape)
print(df)

(2, 3)
   0  1  2
0  1  2  3
1  4  5  6

In [17]:
# Here, index represents the row name and columns represents the column name.
a = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(a,index=['a','b'],columns=['i','j','k'])
print(df)

   i  j  k
a  1  2  3
b  4  5  6

# Functions of DataFrame

In [18]:
d = {'Age':[22,30,23,25,24], 'Salary':[17000,17000,46000,42000,55000], 'Gender':['M','F','M','M','F']}
df = pd.DataFrame(d)
df

   Age  Salary Gender
0   22   17000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [19]:
df1 = df.set_index("Age")
df1

     Salary Gender
Age
22    17000      M
30    17000      F
23    46000      M
25    42000      M
24    55000      F

In [20]:
df1.reset_index()

   Age  Salary Gender
0   22   17000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

# Droping columns and rows:
    syntax(1): df.drop(columns = value)
    syntax(2): df.drop(columns = [values])
    syntax(3): df.drop(index = value)
    syntax(4): df.drop(index = [values])

In [21]:
d = {'Age':[22,30,23,25,24], 'Salary':[17000,17000,46000,42000,55000], 'Gender':['M','F','M','M','F']}
df2 = pd.DataFrame(d)
df2

   Age  Salary Gender
0   22   17000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [22]:
df2.drop(columns="Age")

   Salary Gender
0   17000      M
1   17000      F
2   46000      M
3   42000      M
4   55000      F

In [23]:
df2.drop(columns=["Age","Gender"])

   Salary
0   17000
1   17000
2   46000
3   42000
4   55000

In [24]:
df2.drop(index = 1)

   Age  Salary Gender
0   22   17000      M
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [25]:
df2.drop(index = [1,2,3])

   Age  Salary Gender
0   22   17000      M
4   24   55000      F

# Sorting the pandas
    syntax(1): df.sort_values(by = column name)--> Ascending order
    syntax(2): df.sort_values(by = column name, ascending = False)--> descending order

In [26]:
df2

   Age  Salary Gender
0   22   17000      M
1   30   17000      F
2   23   46000      M
3   25   42000      M
4   24   55000      F

In [27]:
df2.sort_values(by = "Age")

   Age  Salary Gender
0   22   17000      M
2   23   46000      M
4   24   55000      F
3   25   42000      M
1   30   17000      F

In [28]:
df2.sort_values(by = "Age", ascending = False)

   Age  Salary Gender
1   30   17000      F
3   25   42000      M
4   24   55000      F
2   23   46000      M
0   22   17000      M

# Combining DataFrame
    syntax(1): pd.concat([df1, df2], axis = 0)
    syntax(2): pd.concat([df1, df2], axis = 1)

In [29]:
df1 = pd.DataFrame({"city":["mumbai","delhi","banglore","hyderabad"], "temperature": [32, 45, 40, 36]})
df1

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           40
3  hyderabad           36

In [30]:
df2 = pd.DataFrame({"city": ["delhi", "mumbai", "bangalore", "chennai"], "humidity": [68, 65, 75, 70]})
df2

        city  humidity
0      delhi        68
1     mumbai        65
2  bangalore        75
3    chennai        70

In [32]:
pd.concat([df1, df2], axis = 1)

        city  temperature       city  humidity
0     mumbai           32      delhi        68
1      delhi           45     mumbai        65
2   banglore           40  bangalore        75
3  hyderabad           36    chennai        70

In [31]:
pd.concat([df1, df2], axis = 0)

        city  temperature  humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
0      delhi          NaN      68.0
1     mumbai          NaN      65.0
2  bangalore          NaN      75.0
3    chennai          NaN      70.0

In [34]:
# It will give index name in sequential order
pd.concat([df1,df2], ignore_index=True)

        city  temperature  humidity
0     mumbai         32.0       NaN
1      delhi         45.0       NaN
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
4      delhi          NaN      68.0
5     mumbai          NaN      65.0
6  bangalore          NaN      75.0
7    chennai          NaN      70.0

# merge:
    1. left
    2. right
    3. inner
    4. outer

In [35]:
pd.merge(df1,df2,on='city',how='left')

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      68.0
2   banglore           40       NaN
3  hyderabad           36       NaN

In [36]:
pd.merge(df1,df2,on='city',how='right')

        city  temperature  humidity
0      delhi         45.0        68
1     mumbai         32.0        65
2  bangalore          NaN        75
3    chennai          NaN        70

In [37]:
pd.merge(df1,df2,on='city',how='inner')

     city  temperature  humidity
0  mumbai           32        65
1   delhi           45        68

In [38]:
pd.merge(df1,df2,on='city',how='outer')

        city  temperature  humidity
0     mumbai         32.0      65.0
1      delhi         45.0      68.0
2   banglore         40.0       NaN
3  hyderabad         36.0       NaN
4  bangalore          NaN      75.0
5    chennai          NaN      70.0

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "name": ["ramu", "swathi", "lakshmi", "raju", "arun"],
    "age": [25, 27, 24, 30, 28]
})

df2 = pd.DataFrame({
    "name": ["ramu", "swathi", "harish", "suresh", "arun"],
    "age": [15000, 12000, 8000, 10000, 25000]
})

In [3]:
df1

      name  age
0     ramu   25
1   swathi   27
2  lakshmi   24
3     raju   30
4     arun   28

In [4]:
df2

     name    age
0    ramu  15000
1  swathi  12000
2  harish   8000
3  suresh  10000
4    arun  25000

In [6]:
pd.merge(df1,df2,on="name",how="left")

      name  age_x    age_y
0     ramu     25  15000.0
1   swathi     27  12000.0
2  lakshmi     24      NaN
3     raju     30      NaN
4     arun     28  25000.0

In [7]:
pd.merge(df1,df2,on="name",how="right")

     name  age_x  age_y
0    ramu   25.0  15000
1  swathi   27.0  12000
2  harish    NaN   8000
3  suresh    NaN  10000
4    arun   28.0  25000

In [8]:
pd.merge(df1,df2,on="name",how="inner")

     name  age_x  age_y
0    ramu     25  15000
1  swathi     27  12000
2    arun     28  25000

In [9]:
pd.merge(df1,df2,on="name",how="outer")

      name  age_x    age_y
0     ramu   25.0  15000.0
1   swathi   27.0  12000.0
2  lakshmi   24.0      NaN
3     raju   30.0      NaN
4     arun   28.0  25000.0
5   harish    NaN   8000.0
6   suresh    NaN  10000.0